---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorArrowheadScale
source: html/04795564-fbf7-f811-05c7-045363693549.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorArrowheadScale

Defines arrow head scaling for vector settings of analysis display style.

## Syntax (C#)
```csharp
public enum AnalysisDisplayStyleVectorArrowheadScale
```